Tekla.Structures.ModelInternal.dotObjectOperationsEnum
Defines operations done on Tekla Structures core side

Tekla.Structures.ModelInternal.dotObjectOperationsEnum.DOT_CREATE_OBJECT
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotObjectOperationsEnum.DOT_MODIFY_OBJECT
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotObjectOperationsEnum.DOT_SELECT_OBJECT
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotObjectOperationsEnum.DOT_DELETE_OBJECT
DO NOT USE! For internal usage only!